
export const faq_sources = [
    {
        q: "جیم پین چیست؟",
        a:"جیم پین یک پلتفرم آنلاین است که به کاربرانش امکان می‌دهد به سادگی با بیش از هزاران مرکز ورزشی در ایران ارتباط برقرار کنند و عضویت یا بلیط  خود را در آن‌ها خریداری و رزرو کنند ."
    },
    {
        q: "شرکت‌ها چگونه می‌توانند کارمندان خود را در اپلیکشن ثبت نام کنند ؟",
        a:"در بخش شرکت‌ها کامل به این موضوع پرداخته شده است فرم را پرکنید و یا با ما تماس بگیرید."
    },
    {
        q: "آیا جیم پین کلاس‌های ورزشی آنلاین هم برگزار می‌کند ؟",
        a:"رسالت جیم پین ارائه راهکار‌های ورزشی است . و هم اکنون در زمینه رزرو و خرید عضویت مراکز فعالیت می‌کند. جیم پین محدودیتی برای نوع فعالیت ورزشی ندارد و اگر فعالیت‌های آنلاین ورزشی توسط مجموعه‌ها ارائه شود در بخش ورزش‌ها فابل مشاهده خواهد بود."
    },
    {
        q: "آیا جیم پین برای استفاده کاربران هزینه دریافت می‌کند ؟",
        a:"خیر، جیم پین هیچ هزینه ای برای خدمات خود از کاربر دریافت نمی‌کند و پرداختی کاربران تنها مربوط به خدماتی است که دریافت خواهند نمود.استفاده از جیم پین برای کاربران رایگان است. با این حال، هزینه عضویت و یا استفاده از خدمات در مراکز ورزشی و تفریحی متفاوت است"
    },
    {
        q: "از چه امکاناتی در جیم پین می‌توان استفاده کرد؟",
        a:"از امکانات جیم پین می‌توان به جستجوی و رزرو مجموعه‌های ورزشی، دسترسی به تخفیف‌ها و پیشنهادهای ویژه، دسترسی به برنامه‌های تمرینی و تغذیه‌ای و همچنین ارتباط با مربیان و اعضای دیگر جیم پین اشاره کرد."
    },
    {
        q: "جیم پین برای چه کسانی مناسب است؟",
        a:"جیم پین برای کسانی مناسب است که به دنبال تمرین و ورزش منظم و سالم هستند. همچنین مدیران شرکت‌ها و سازمان‌ها نیز می‌توانند با استفاده از جیم پین، عضویت در مراکز ورزشی را برای کارمندانشان تسهیل کنند و سلامتی به آنها هدیه کنند"
    },
    {
        q: "چگونه می‌توان مرکز ورزشی را در جیم پین ثبت کرد؟",
        a:"مراکز ورزشی می‌توانند با مراجعه به وبسایت جیم پین، درخواست ثبت نام خود را ثبت کنند و پس از تایید، به شبکه جیم پین اضافه می‌شوند."
    },
    {
        q: "آیا تنها مراکز ورزشی می‌توانند در جیم پین عضو شوند؟",
        a:"خیر، هر مرکزی که خدمات تفریحی و یا ورزشی که خدمات ارائه می‌دهد و مایل به عضویت در شبکه جیم پین است، می‌تواند عضو شود."
    },
    {
        q: "آیا جیم پین در خارج از تهران هم فعالیت دارد؟",
        a:"خیر، در حال حاضر جیم پین فقط در تهران فعال است و خدمات خود را برای کاربران ارائه میدهد"
    },
    {
        q: "آیا جیم پین تنها برای سازمان‌ها و شرکت‌ها قابل استفاده است؟",
        a:"جیم پین علاوه بر ارائه خدمات به سازمان‌ها و شرکت‌ها، برای کاربران عادی نیز قابل استفاده است. با استفاده از وب اپلیکیشن جیم پین، کاربران می‌توانند با مراجعه به مراکز ورزشی مختلف از خدمات آن‌ها استفاده کنند و با پرداخت آنلاین و استفاده از تخفیف‌ها، هزینه‌های ورزشی خود را پرداخت کنند"
    },
    {
        q: "مزایای استفاده از جیم پین برای مجموعه‌های ورزشی چیست ؟",
        a:"افزایش فروش با ورود کاربران جدید به مرکز ورزشی\n" +
            "کاهش هزینه‌های بازاریابی و تبلیغات با استفاده از پلتفرم تبلیغاتی جیم پین\n" +
            "دسترسی به اطلاعات دقیق و به روز درباره کاربران مرکز ورزشی\n" +
            "امکان ارائه برنامه‌های ورزشی و تغذیه به کاربران\n" +
            "افزایش نظم در سیستم مالی و پرداخت‌ها\n" +
            "امکان توزیع ترافیک و نمایش به کاربران\n"
    },
    {
        q:"آیا اطلاعات شخصی من در جیم پین محفوظ است؟",
        a:"بله، جیم پین از تکنولوژی رمزگذاری اطلاعات استفاده می‌کند و اطلاعات شخصی شما در این پلتفرم محفوظ خواهد بود. همچنین، جیم پین اطلاعات شخصی شما را با شرکت‌ها و سازمان‌های دیگر به اشتراک نمی‌گذارد و از آنها حفاظت می‌کند.همچنین باید توجه داشت که اطلاعات عمومی‌و تماس شما با مراکزی که از آنها خدمات دریافت می‌کنید به اشتراک گذاشته میشود"
    },
    {
        q: "آیا جیم پین به مراکز ورزشی خارج از کشور خدمات ارائه می‌دهد؟",
        a:"در حال حاضر، جیم پین خدمات خود را در داخل ایران ارائه می‌دهد و به مراکز ورزشی خارج از کشور خدماتی ارائه نمی‌دهد. با این حال، امکان همکاری با مراکز ورزشی خارج از کشور در آینده وجود دارد"
    }

]
