import React from 'react';
import {Typography} from "@mui/material";
import _PageTitle from "../partials/_PageTitle.js";
import _ImageText from "../partials/_ImageText.js";
import _TextImage from "../partials/_TextImage.js";

const About = () => {
    return (<>
            <_PageTitle title={"آشنایی با جیم پین"} subtitle={"با جیم پین در مسیر سلامتی قدم بردارید"} />
            <_ImageText image={"/assets/images/about-man.jpg"} alt={"ورزش در سازمان مهم ترین عامل رشد است"} text={"جیم پین یک استارتاپ فعال در حوزه ورزش و سلامت است که با هدف ترویج فعالیت‌های بدنی و بهبود سلامتی، از سال 1400 شروع به فعالیت نموده است. ما در جیم پین به ارائه خدمات، معرفی و رزرو مراکز ورزشی به صورت آنلاین برای شرکت‌ها و سازمان‌ها اهتمام داریم. هدف ما ایجاد فضایی راحت و مطمئن برای پیداکردن و انجام فعالیت‌های ورزشی است."} />
            <_TextImage image={"/assets/images/daftar-laptop.jpg"} alt={"جیم پین پل ارتباطی سازمان‌ها و ورزش"} text={"ما اعتقاد داریم که ورزش یکی از راهکارهای بسیار مهم در بهبود سلامتی و روحیه افراد است. در جیم پین به این موضوع توجه فراوان داریم و تلاش می‌کنیم با ارائه زیرساخت لازم به مراکز ورزشی با یک سیستم هوشمند مدیریت این امکان را برای مدیران مراکز ورزشی فراهم کنیم."} />
            <_ImageText image={"/assets/images/mobile-laptop.jpg"} alt={"سازمان‌ها ورزش می‌کنند"} text={"تیم جیم پین از افرادی حرفه ای تشکیل شده است که دارای تجربه کافی در حوزه برنامه نویسی و مارکتینگ و ... هستند و با مشاوره افراد و مربیان حرفه ای این حوزه روزانه برای توسعه این پلتفرم تلاش می‌کنند.\n" +
            "کوشش ما برای ارائه خدمات ورزشی به سازمان‌ها با بالاترین کیفیت و بیشترین سرعت است که با بهره‌گیری از تکنولوژی‌های روز، تلاش می‌کنیم تا پلتفرمی‌با طراحی جذاب و کارآمد در اختیار شان قرار دهیم."} />
            <Typography sx={{mb:12}} />
        </>);
};

export default About;
