import React from 'react'

export default function AboutSection() {
    return (
        <>
            {/* <!-- privacy section start --> */}
            <div className="privacy-policy-section pt-125 pb-125">
                <div className="container">
                    <div className="row rtl">
                        <div className="col-xl-12">
                            <div className="privacy__highlight mb-30">
                                <p>جیم پین یک استارتاپ فعال در حوزه ورزش و سلامت است که با هدف ترویج فعالیت های بدنی و بهبود سلامتی، از سال 1400 شروع به فعالیت نموده است. ما در جیم پین به ارائه خدمات، معرفی و رزرو مراکز ورزشی به صورت آنلاین برای شرکت ها و سازمان ها و همچنین عموم مردم اهتمام داریم. هدف ما ایجاد فضایی راحت و مطمئن برای پیداکردن و انجام فعالیت های ورزشی است.</p>
                            </div>
                        </div>
                        <br/>
                        <br/>
                        <br/>
                        <br/>
                        <br/>
                        <div className="col-xl-12">
                            <p>اعتقاد داریم که ورزش یکی از راهکارهای بسیار مهم در بهبود سلامتی و روحیه افراد است. در جیم پین به این موضوع توجه فراوان داریم و تلاش می‌کنیم با ارائه زیرساخت لازم به مراکز ورزشی با یک سیستم هوشمند مدیریت این امکان را برای مدیران مراکز ورزشی فراهم کنیم.</p>
                        </div>
                        <br/>
                        <br/>
                        <br/>
                        <div className="col-xl-12">
                            <p>
                                تیم ما از افرادی حرفه ای تشکیل شده است که دارای تجربه کافی در حوزه برنامه نویسی و مارکتینگ و ... هستند و با مشاوره افراد و مربیان حرفه ای این حوزه  روزانه برای توسعه این پلتفرم تلاش میکنند.
                            </p>
                        </div>
                        <br/>
                        <br/>
                        <br/>
                        <div className="col-xl-12">
                            <p>در جیم پین کوشش ما برای ارائه خدماتی با بالاترین کیفیت و بیشترین سرعت است که با بهره‌گیری از تکنولوژی روز، تلاش می‌کنیم تا پلتفرمی با طراحی جذاب و کارا در اختیار شما قرار دهیم.</p>
                        </div>
                        <br/>
                        <br/>
                    </div>
                </div>
            </div>
            {/* <!-- privacy section end --> */}

        </>
    )
}
