
export const faq_places = [
    {
        q: "چگونه می‌توانم مرکز خود را در جیم پین معرفی کنم؟",
        a:"فرآیند ثبت‌نام در جیم پین بسیار ساده است. تنها کافیست اطلاعات  خود را در فرم ثبت‌نام وارد کنید تا کارشناسان ما با شما تماس بگیرند"
    },
    {
        q: "آیا جیم پین به مراکز در جذب مشتری کمک می‌کند؟",
        a:"بله، جیم پین با اتصال مراکز به هزاران کارمند در شرکت‌های مختلف، فرصت‌های بی‌نظیری را برای جذب مشتریان جدید فراهم می‌کند."
    },
    {
        q: "چگونه می‌توانم از پشتیبانی جیم پین بهره‌مند شوم؟",
        a:" تیم پشتیبانی جیم پین به صورت ۲۴ ساعته آماده پاسخگویی به سوالات و مشکلات شما است. می‌توانید از طریق تلفن، ایمیل یا تیکت آنلاین با ما در ارتباط باشید."
    }
]
