import React from 'react';

const HomeOneDesc2 = () => {
    return (
        <>
            <div className="details-content-area pt-80 pb-85">
                <div className="container">
                    <div className="row">
                        <div className="details-content rtl">
                            <div className="row mt-10">
                                <div className="col-xl-12">
                                    <h2 className="details-content__title mb-20">جیم پین برای کارمندان</h2>
                                    <p>جیم پین برای کارمندان مزایایی از جمله دسترسی آسان به مراکز ورزشی،
                                        افزایش تنوع و انگیزه، کاهش استرس و افزایش رضایت شغلی، مدیریت
                                        زمان، تشویق به همکاری و تعهد به سازمان، و بهبود عملکرد و پروداکتیویتی
                                        فراهم می کند. این مزایا به سلامتی و رضایت کارمندان کمک کرده و می تواند
                                        به سازمان در بهبود عملکرد و تعهد کارمندان کمک کند.</p>
                                    <ul className="privacy__lists">
                                        <li>
                                            کاربران جیم پین به تخفیف های ویژه در عضویت های سالانه یا ماهانه و یا حتی روزانه در مراکز ورزشی دسترسی دارند. این تخفیف ها معمولا باعث کاهش هزینه های عضویت می شوند و همواره در اپلیکیشن اختصاصی کاربران ، به اطلاع آنها رسانده میشود.
                                        </li>
                                        <li>
                                            فعالیت های ورزشی معمولا به صورت گروهی انجام می شوند که می تواند به تعاملات اجتماعی و تیمی میان کارمندان کمک کند. این ارتباطات به افزایش همبستگی در سازمان منجر خواهد شد.
                                        </li>
                                        <li>
                                            جیم پین با فراهم کردن دسترسی آسان سازمان ها به مراکـز ورزشی و ترفندهای ترویجی ورزشی ، به سازمان ها و کارکنانشان فرصت می دهد تا سلامتی خود را تقویت کنند. کارکنان ، سالم تر و با انرژی بیشتری می توانند بهره وری کاری خود را افزایش دهند .
                                        </li>
                                    </ul>

                                    <div className="details-content__thumb mt-35 mb-35">
                                        <img src="/images/bg/vide-bg-2.jpeg" alt=""/>
                                    </div>
                                    <p>به طور کلی، استفاده از جیم پین به سازمان ها این امکان را می دهد تا سلامت و
                                        رفاه کارمندان خود را تقویت کرده و بر کیفیت زندگی حرفه ای و شخصی آنها
                                        تاثیرگذار باشد. این اقدام می تواند به بهبود محیط کار، کاهش هزینه ها، و تعهد به
                                        سلامتی کارمندان منجر شود.
                                    </p>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </>
    );
};

export default HomeOneDesc2;
